In [3]:
'''Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.'''
import pandas as pd
s=pd.Series([4, 8, 15, 16, 23,42])
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
'''Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.'''
l=[1,2,3,4,5,6,7,8,9,10]
x=pd.Series(l)
x

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [4]:
'''Q3. Create a Pandas DataFrame that contains the following data:'''
df=pd.DataFrame({"Name":["Alaice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})
df

     Name  Age  Gender
0  Alaice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [3]:
'''Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Answer-A DataFrame is a data structure that organizes data into a 2-dimensional table of rows and columns, much like
a spreadsheet. DataFrames are one of the most common data structures used in modern data analytics because they are a 
flexible and intuitive way of storing and working with data.'''
#ecample of series
import pandas as pd
l=[1,2,3,4,5,6,7,8,9,10]
x=pd.Series(l)
x

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [2]:
#Ecample of dataFrame
df=pd.DataFrame({"Name":["Alaice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})
df

     Name  Age  Gender
0  Alaice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
'''Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
Answer-Some common function that is used to manipulate data in a pandas DataFrame is_null(),filna(),dropna(),mean(),median()
iloc(),loc() etc.'''
df.isnull()
df.mean()
df.max()
df.min()
df.set_index('Name')

In [ ]:
'''Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Answer-DataFrame is mutable in nature and the series is not mutable datastructure and in panel data and data size of the panel
is mutable.'''